; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_1 ?v3 - type_2 ?v4 - type_1)
 	      (pred_4 ?v6 - object ?v4 - type_1)
	      (pred_2 ?v3 - type_2 ?v1 - type_3)
	      (pred_3 ?v3 - type_2 ?v6 - object ?v1 - type_3))

   (:action op_2
       :parameters  (?v3 - type_2 ?v7 ?v5 - type_1)
       :precondition (and  (pred_1 ?v3 ?v7))
       :effect (and  (pred_1 ?v3 ?v5)
		     (not (pred_1 ?v3 ?v7))))

   (:action op_1
       :parameters (?v3 - type_2 ?v8 - object ?v2 - type_1 ?v1 - type_3)
       :precondition  (and  (pred_4 ?v8 ?v2) (pred_1 ?v3 ?v2) (pred_2 ?v3 ?v1))
       :effect (and (pred_3 ?v3 ?v8 ?v1)
		    (not (pred_4 ?v8 ?v2)) 
		    (not (pred_2 ?v3 ?v1))))

   (:action op_3
       :parameters (?v3 - type_2 ?v8 - object ?v2 - type_1 ?v1 - type_3)
       :precondition  (and  (pred_3 ?v3 ?v8 ?v1) (pred_1 ?v3 ?v2))
       :effect (and (pred_4 ?v8 ?v2)
		    (pred_2 ?v3 ?v1)
		    (not (pred_3 ?v3 ?v8 ?v1)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_10 obj_02 - type_2
obj_13 obj_06 obj_07 obj_11 - type_3
obj_04 obj_08 obj_12 obj_01 - type_1
obj_03 obj_09 obj_05 - object)
(:init
(pred_1 obj_10 obj_04)
(pred_2 obj_10 obj_13)
(pred_2 obj_10 obj_06)
(pred_1 obj_02 obj_12)
(pred_2 obj_02 obj_07)
(pred_2 obj_02 obj_11)
(pred_4 obj_03 obj_08)
(pred_4 obj_09 obj_04)
(pred_4 obj_05 obj_12)
)
(:goal
(and
(pred_4 obj_03 obj_01)
(pred_4 obj_09 obj_12)
(pred_4 obj_05 obj_08)
)
)

(:constraints
  (always (not (pred_1 obj_10 obj_12)))
)
)

; plan
1. (op_2 obj_10 obj_04 obj_08)
   deleted: (pred_1 obj_10 obj_04)
   added: (pred_1 obj_10 obj_08)
   goals met: 0 of 3
2. (op_1 obj_02 obj_05 obj_12 obj_11)
   deleted: (pred_4 obj_05 obj_12) (pred_2 obj_02 obj_11)
   added: (pred_3 obj_02 obj_05 obj_11)
   goals met: 0 of 3
3. (op_1 obj_10 obj_03 obj_08 obj_06)
   deleted: (pred_4 obj_03 obj_08) (pred_2 obj_10 obj_06)
   added: (pred_3 obj_10 obj_03 obj_06)
   goals met: 0 of 3
4. (op_2 obj_02 obj_12 obj_08)
   deleted: (pred_1 obj_02 obj_12)
   added: (pred_1 obj_02 obj_08)
   goals met: 0 of 3
5. (op_2 obj_10 obj_08 obj_01)
   deleted: (pred_1 obj_10 obj_08)
   added: (pred_1 obj_10 obj_01)
   goals met: 0 of 3
6. (op_3 obj_02 obj_05 obj_08 obj_11)
   deleted: (pred_3 obj_02 obj_05 obj_11)
   added: (pred_4 obj_05 obj_08) (pred_2 obj_02 obj_11)
   goals met: 1 of 3
7. (op_3 obj_10 obj_03 obj_01 obj_06)
   deleted: (pred_3 obj_10 obj_03 obj_06)
   added: (pred_4 obj_03 obj_01) (pred_2 obj_10 obj_06)
   goals met: 2 of 3
8. (op_2 obj_02 obj_08 obj_04)
   deleted: (pred_1 obj_02 obj_08)
   added: (pred_1 obj_02 obj_04)
   goals met: 2 of 3
9. (op_1 obj_02 obj_09 obj_04 obj_11)
   deleted: (pred_4 obj_09 obj_04) (pred_2 obj_02 obj_11)
   added: (pred_3 obj_02 obj_09 obj_11)
   goals met: 2 of 3
10. (op_2 obj_02 obj_04 obj_12)
   deleted: (pred_1 obj_02 obj_04)
   added: (pred_1 obj_02 obj_12)
   goals met: 2 of 3
11. (op_3 obj_02 obj_09 obj_12 obj_11)
   deleted: (pred_3 obj_02 obj_09 obj_11)
   added: (pred_4 obj_09 obj_12) (pred_2 obj_02 obj_11)
   goals met: 3 of 3
